OpenFOAM-2.3.x/tutorials/multiphase/interDyMFoam/ras/floatingObject/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    stationaryWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2800;
        startFace       33146;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       35946;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          348;
        startFace       36346;
    }
)

// ************************************************************************* //
